content/roam/20230224172609-okr_2023.org
:PROPERTIES:
:ID:       fa8c695f-0122-4b0c-9e02-c5d128d97ff2
:END:
#+title: OKR-2023

* Table


+------+-------------------------------+----------------------------------------------------+---------------+----------------+-------------+-------+
| 序号 | 目标内容                      | 行动计划                                           | 计划完成时间  | 协同部门       | 协同人      | 权重  |
+------+-------------------------------+----------------------------------------------------+---------------+----------------+-------------+-------+
|    1 |VEOS 开发及 EC1 随量产推送     | 1.1 EOS 云端测试和调试开发（VCS, docker,           |  2023Q1-Q3    | 电动力电子电器 |  王洪帅     |  30%  |
|      |                               |debugging，数据库接口开发调试）                     |               | ITS 感知与软件 |  陆自立     |       |
|      |                               | 1.2 EOS 接口设计模式开发（抽象基类 ABC 适配，数据  |               | ITS 商业智能   |  刘涛       |       |
|      |                               |基类 datalcass 适配,mixin, 异常处理类开发调试         |               |                |             |       |
|      |                               | 1.3 序列模型升级（应用 transformer）               |               |                |             |       |
+------+-------------------------------+----------------------------------------------------+---------------+----------------+-------------+-------+
|    2 |VEOS 迭代开发及 iC1 随量产推送 | 1.1 EOS 平台化开发（MLOps，Pytorch 重构，深度学习训 |  2023Q2-Q4    | 电动力电子电器 |  王洪帅     |  30%  |
|      |                               |练调试环境开发）                                    |               | ITS 感知与软件 |  陆自立     |       |
|      |                               | 1.2 VEOS 强化学习相关性能研究（RLHF/离线数据 RL/高效|               | ITS 商业智能   |  刘涛       |       |
|      |                               |记忆检索/Transformer 强化学习应用）                  |               |                |             |       |
|      |                               | 1.3 提交完成 EI 可检索的论文一篇                   |               |                |             |       |
+------+-------------------------------+----------------------------------------------------+---------------+----------------+-------------+-------+
|    3 |电池银行数据处理               | 1.1 基于 EP 电池组稳定时间序列特征的生成模型（电压 |  2023Q2-Q4    | 电动力电池系统 |  沈迪       |  20%  |
|      |                               |SoC 曲线，差分充电特征）                             |               | ITS 商业智能   |  刘涛       |       |
|      |                               | 1.2 基于扩散模型的时间序列生成模型                 |               |                |             |       |
|      |                               | 1.3 完成两个前瞻技术报告                           |               |                |             |       |
+------+-------------------------------+----------------------------------------------------+---------------+----------------+-------------+-------+
|    4 |能力建设, 招聘和培训           | 1.1 开展和维护前晨专利内审                         |  2023Q1-Q4    | 企业治理法务   | 黄健        |  20%  |
|      |                               | 1.2 部门完成四个专利申请至少含两个发明             |               | 人事行政       | 严丹丹      |       |
|      |                               | 1.3 完成深度学习大型语言模型生成模型培训           |               |                |             |       |
+------+-------------------------------+----------------------------------------------------+---------------+----------------+-------------+-------+


* Org Table


| 序号 | 目标内容                      | 行动计划                                           | 计划完成时间  | 协同部门       | 协同人      | 权重  |
|    1 |VEOS 开发及 EC1 随量产推送     | 1.1 EOS 云端测试和调试开发（VCS, docker,           |  2023Q1-Q3    | 电动力电子电器 |  王洪帅     |  30%  |
|      |                               |debugging，数据库接口开发调试）                     |               | ITS 感知与软件 |  陆自立     |       |
|      |                               | 1.2 EOS 接口设计模式开发（抽象基类 ABC 适配，数据  |               | ITS 商业智能   |  刘涛       |       |
|      |                               |基类 datalcass 适配,mixin, 异常处理类开发调试         |               |                |             |       |
|      |                               | 1.3 序列模型升级（应用 transformer）               |               |                |             |       |
|    2 |VEOS 迭代开发及 iC1 随量产推送 | 1.1 EOS 平台化开发（MLOps，Pytorch 重构，深度学习训 |  2023Q2-Q4    | 电动力电子电器 |  王洪帅     |  30%  |
|      |                               |练调试环境开发）                                    |               | ITS 感知与软件 |  陆自立     |       |
|      |                               | 1.2 VEOS 强化学习相关性能研究（RLHF/离线数据 RL/高效|               | ITS 商业智能   |  刘涛       |       |
|      |                               |记忆检索/Transformer 强化学习应用）                  |               |                |             |       |
|      |                               | 1.3 提交完成 EI 可检索的论文一篇                   |               |                |             |       |
|    3 |电池银行数据处理               | 1.1 基于 EP 电池组稳定时间序列特征的生成模型（电压 |  2023Q2-Q4    | 电动力电池系统 |  沈迪       |  20%  |
|      |                               |SoC 曲线，差分充电特征）                             |               | ITS 商业智能   |  刘涛       |       |
|      |                               | 1.2 基于扩散模型的时间序列生成模型                 |               |                |             |       |
|      |                               | 1.3 完成两个前瞻技术报告                           |               |                |             |       |
|    4 |能力建设和招聘和培训           | 1.1 开展和维护前晨专利内审                         |  2023Q1-Q4    | 企业治理法务   | 黄健        |  20%  |
|      |                               | 1.2 部门完成四个专利申请至少含两个发明             |               | 人事行政       | 严丹丹      |       |
|      |                               | 1.3 完成深度学习大型语言模型生成模型培训           |               |                |             |       |





** from org table

+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
| 序号 | 目标内容             | 行动计划                                         | 计划完成时间 | 协同部门       | 协同人 | 权重 |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|    1 | VEOS 开发及          | 1.1 EOS 云端测试和调试开发(VCS, docker,          | 2023Q1-Q3    | 电动力电子电器 | 王洪帅 |  30% |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      | EC1 随量产推送       | debugging,数据库接口开发调试)                    |              | ITS 感知与软件 | 陆自立 |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      |                      | 1.2 EOS 接口设计模式开发(抽象基类 ABC 适配,      |              | ITS 商业智能   | 刘涛   |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      |                      | 数据基类 dataclass, mixin,异常处理类开发调试)    |              |                |        |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      |                      | 1.3 序列模型升级（应用 transformer）              |              |                |        |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      |                      |                                                  |              |                |        |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|    2 | VEOS 迭代开发        | 1.1 EOS 平台化开发                               | 2023Q2-Q4    | 电动力电子电器 | 王洪帅 |  30% |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      | 及 iC1 随量产推送    | （MLOps, Pytorch 重构, 深度学习训练调试环境开发） |              | ITS 感知与软件 | 陆自立 |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      |                      | 1.2 VEOS 强化学习相关性能研究                    |              | ITS 商业智能   | 刘涛   |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      |                      | （RLHF/离线数据使用/高效记忆检索/                 |              |                |        |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      |                      | transformer 模型强化学习应用）                    |              |                |        |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      |                      | 1.3 提交完成 EI 可检索的论文一篇                 |              |                |        |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|    3 | 电池银行数据处理     | 1.1 基于 EP 电池组稳定时间序列特征的生成模型     | 2023Q2-Q4    | 电动力电池系统 | 沈迪   |  20% |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      |                      | （电压 SoC 曲线，差分充电特征）                   |              | ITS 商业智能   | 刘涛   |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      |                      | 1.2 基于扩散模型的时间序列生成模型               |              |                |        |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      |                      | 1.3 完成两个前瞻技术报告                         |              |                |        |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|    4 | 能力建设和招聘和培训 | 1.1 开展和维护前晨专利内审                       | 2023Q1-Q4    | 企业治理法务   | 黄健   |  20% |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      |                      | 1.2 部门完成 4 个专利申请（至少含两个发明）       |              | 人事行政       | 严丹丹 |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      |                      | 1.3 完成深度学习（大型语言模型，生成模型）培训    |              |                |        |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+
|      |                      | 系列，4次                                         |              |                |        |      |
+------+----------------------+--------------------------------------------------+--------------+----------------+--------+------+






* wrong table


* table

+------+---------------------------+-------------------------------------------------+---------------+----------------+-------------+-------+
| 序号 | 目标内容                  | 行动计划                                        | 计划完成时间  | 协同部门       | 协同人      | 权重  |
+------+---------------------------+-------------------------------------------------+---------------+----------------+-------------+-------+
|    1 |VEOS 开发及                | 1.1 EOS 云端测试和调试开发(VCS, docker,         |  2023Q1-Q3    | 电动力电子电器 |  王洪帅     |  30%  |
|      |EC1 随量产推送             |debugging,数据库接口开发调试)                    |               | ITS 感知与软件 |  陆自立     |       |
|      |                           | 1.2 EOS 接口设计模式开发(抽象基类 ABC 适配,     |               | ITS 商业智能   |  刘涛       |       |
|      |                           | 数据基类 dataclass, mixin,异常处理类开发调试)   |               |                |             |       |
|      |                           | 1.3 序列模型升级（应用 transformer）            |               |                |             |       |
|      |                           |                                                 |               |                |             |       |
|      |                           |                                                 |               |                |             |       |
|      |                           |                                                 |               |                |             |       |
+------+---------------------------+-------------------------------------------------+---------------+----------------+-------------+-------+
|      |                           | 1.2 VEOS 强化学习相关性能研究                   |               | ITS 商业智能   |  刘涛       |       |
|      |                           | （RLHF/离线数据使用/高效记忆检索/               |               |                |             |       |
|      |                           | transformer 模型强化学习应用）                  |               |                |             |       |
|      |                           | 1.3 提交完成 EI 可检索的论文一篇                |               |                |             |       |
+------+---------------------------+-------------------------------------------------+---------------+----------------+-------------+-------+
|    3 |电池银行数据处理           |  1.1 基于 EP 电池组稳定时间序列特征的生成模型   |  2023Q2-Q4    | 电动力电池系统 |  沈迪       |  20%  |
|      |                           | （电压 SoC 曲线，差分充电特征）                  |               | ITS 商业智能   |  刘涛       |       |
|      |                           |  1.2 基于扩散模型的时间序列生成模型             |               |                |             |       |
|      |                           |  1.3 完成两个前瞻技术报告                       |               |                |             |       |
+------+---------------------------+-------------------------------------------------+---------------+----------------+-------------+-------+
|    4 |能力建设和招聘和培训       | 1.1 开展和维护前晨专利内审                      |  2023Q1-Q4    | 企业治理法务   | 黄健       |  20%  |
|      |                           | 1.2 部门完成 4 个专利申请（至少含两个发明）     |               | 人事行政        | 严丹丹    |       |
|      |                           | 1.3 完成深度学习（大型语言模型，生成模型）培训   |               |                |            |       |
|      |                           |系列，4次                                        |               |                |             |       |
+------+---------------------------+-------------------------------------------------+---------------+----------------+-------------+-------+

