20230224172609-okr_2023.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OKR-2023</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">OKR-2023</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org514199e">Table</a></li>
<li><a href="#org989971c">Org Table</a>
<ul>
<li><a href="#org8993915">from org table</a></li>
</ul>
</li>
<li><a href="#org33783eb">wrong table</a></li>
<li><a href="#orga029c53">table</a>
<ul>
<li><a href="#orgdc1172d">org table template</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       fa8c695f-0122-4b0c-9e02-c5d128d97ff2
</p>
